docker-and-kubernetes.org
#+TITLE:      Docker and Kubernete
#+AUTHOR:     Ali Ebadian
#+EMAIL:      
#+OPTIONS:    H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t TeX:t LaTeX:t skip:nil d:(HIDE) tags:not-in-toc
#+STARTUP:    align content nodlcheck hidestars oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c)
#+LANGUAGE:   en
#+PRIORITIES: A C B
#+CATEGORY:   code
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />


#+LaTeX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER: \usepackage[margin=1.25in]{geometry}
#+LaTeX_HEADER: \usepackage{fourier}
#+LaTeX_HEADER: \usepackage[scaled]{helvet}
#+LaTeX_HEADER: \usepackage{courier}
#+LaTeX_HEADER: \linespread{1.10}


#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+OPTIONS: num:nil toc:2
# None/Fade/Slide/Convex/Concave/Zoom
# Black/White/League/Sky/Beige/Simple/Serif/Blood/Night/Moon/Solarized
#+REVEAL_THEME: sky


# This file is the default header for new Org files in Worg.  Feel free
# to tailor it to your needs.



* Docker
** Installation
***  Auto-compelete 
    See [[https://docs.docker.com/docker-for-mac/#install-shell-completion][docker guide]].
    You might need to add ~autoload -Uz compinit; compinit~ to the end ~.zshrc~
**** Installing on Linux
     Go to [[http://store.docker.com][docker store]] it has instructions and dont install via package mamanger.
     This will get you the edge builds, which should be fine as docker moves fast.
   
     A cheat for installing is a script that you find  [[http://get.docker.com][here]]. This gives a script that will install docker with ease.
     Inorder to stop using ~sudo~ with every command you have to add your user to the docker group:
     #+begin_src 
      sudo usermod -aG docker <USERNAME>
     #+end_src
     Then log out and log back in again.
     This is not recomended bu security so dont do that on prod. Some distros do not allow you to do this.
  
     Docker machine and docker compose have to ne installed manually on Linux boxes.
     [[https://github.com/docker/machine/releases][Docker machine]]
     [[https://github.com/docker/compose/releases][Docker compose installer]]
   
     Since these are manually installed you might have manually update them.
**** Shell customization    
    [[http://bretfisher.com/shell][see bret's customization]]

** Creating and using containers

*** checking config and isntallation

**** ~docker version~

**** ~docker info~

*** Image vs container
**** An image is the application we want to run
**** A container is an instance of that image running as a process
     You can have many instances of an image running at the same time.
*** Running a container
    ~docker container run --publish 80:80 ngix~
    - This downloads 'ngix' image from docker hub.
    - Starts a container from that image.
    - Opened port 80 on the host IP
    - Routes that traffic to the container IP, port 80.
    
    You can use the option ~--detach~ to run the above command in the background. The command will return a unique ID hack.
    To see list the containers running use ~docker container ls~. 
    To stop a running container use ~docker container stop <CONTAINER ID>~.
    By default docker will give a random name that you use to address the container. You can set the name of the container by using ~--name <NAME>~ when you start the container.
    ~docker container logs <CONTAI"NER NAME>~ will show you the logs produced by the container.
    To clean up the stoped container you can issue the command ~docker container rm <CONTAINER ID> <CONTAINER ID> ..~
    
    What happens in ~docker container run~
       1.Looks for that image locally in image cache, doesn't find anything
       2.Then looks in remote image repository (defaults to Docker Hub) 
       3.Downloads the latest version (nginx:latest by default) 
       4.Creates new container based on that image and prepares to start 
       5.Gives it a virtual IP on a private network inside docker engine 
       6.Opens up port 80 on host and forwards to port 80 in container 
       7.Starts container by using the CMD in the image Dockerfile

    Docker is a procerss.
** Play
   #+begin_src bash 
    docker container run --detach --publish 80:80  --name nginx  nginx
    docker container run --detach --publish 3306:3306  --name sql  --env MYSQL_RANDOM_ROOT_PASSWORD=yes mysql
    docker container logs sql | grep "PASSWORD"
    docker container run --detach --publish 8080:80  --name server httpd
    docker container ls -a
    docker container stop server sql nginx
   #+end_src
** Basic look inside container
  ~docker container top~     - process list in one container \\ 
  ~docker container inspect~ - details of one container config  \\
  ~docker container stats~   - performance stats for all containers \\
** Running Shell commands in a container
  ~docker container run -it~ - Starts the new container interactivly
   e.g:
   #+begin_src 
    docker container run -it --name proxy nginx bash
   #+end_src
   The above example what we did was to override the default command that runs with a ~bash~ command.
 
  ~docker container exec -it~ - Run command in container currently running
  e.g:
  #+begin_src
  docker container exec -it mysql bash
  #+end_src
  The above example opens a terminal in the running container ~mysql~ 
  ~-it~ is two seprate options:
  ~-t~ also ~-tty~ this is a pseudo-tty -Simulates a real terminal like SSH.   
  ~-i~, ~--interactive~ Keeps the session open to receive terminal intput.
** TODO  Networks
    ~--publish~ (~-p~) format in HOST:CONTAINER
*** Networks CLI 
**** TODO What is NAT in networking
**** ~docker container inspect~ This shows you the container configuration such as specific container like Networks, IP address, mounts, and current status. It can also be modified to only return a specific piece of data using the —format flag. 
** Container images finding and buidling them
*** What is an images?
Just App binaries and dependencies with metadata about the image and how to run it.
There is no kernal or any drivers involved, those are provided by the host. (This is different to Virtual Machines)
** Building Docker Images
    Dockerfiles are layered, each layer is cached so in the next build if the layer has not changed (its hash hasn't changed) it will not rebuild it from scratch.

    #+begin_src docker
    FROM //Typical start of docker file. Normally something small like Alpine linux
    ENV  //Sets enviroment vars
    ARGS //Set Variables
    RUN  // Command to run for set up such as apt-get
    WORKDIR // this is prefered way of changing directory over RUN cd
    EXPOSE //This opens up a port so that you can 'map' to it when running the image using -p option (e.g 80:3000)
    CMD     //The last command to run, such as /bash. This is inhereted from base image if not included.
    #+end_src
    
    For variables that are needed to build an image only its best to use ~ARG~ and inorder to set variables that are needed as /Enviroment Variables/ in the ruuning container ~ENV~ is best suited.

*** TODO prunning images
** Volumes and Bind mounts
*** persistance data
   Containers are immutable and ephermal, this means data will disapear as soon as its removed. So data such databases might lose data. To keep the data docker in two main ways:
**** Data Volumes
     Makes a special location outside of container UFS. Volumes live after the container and are only removed manually.
