docker-and-kubernetes.md

# Table of Contents

-   [Docker](#org7f89d07)
    -   [Installation](#org620e8ce)
    -   [Creating and using containers](#org070bc65)
    -   [Play](#org19afb67)
    -   [Basic look inside container](#orgfee85ce)
    -   [Running Shell commands in a container](#org4976971)
    -   [Networks](#org1a54b42)
    -   [Container images finding and buidling them](#org550c8ff)
    -   [Building Docker Images](#orgbe71b60)
    -   [Volumes and Bind mounts](#orgf964cbd)
    -   [Docker Compose](#org3a5160a)
-   [Swarm](#orgaa88003)
    -   [RAFT](#org81998bf)
    -   [Manager Node](#org6c9f46f)
    -   [Worker Node](#org9c591ad)
-   [Kubernetes](#org57ea59a)
    -   [Architecture](#org85859fd)
    -   [Minikube](#org3188f3c)
    -   [Helm, packaaging and deploying](#org81ca67d)
-   [Cheat sheets](#orgb625d62)



<a id="org7f89d07"></a>

# Docker


<a id="org620e8ce"></a>

## Installation


### Auto-compelete

See [docker guide](https://docs.docker.com/docker-for-mac/#install-shell-completion).
You might need to add `autoload -Uz compinit; compinit` to the end `.zshrc`

-   Installing on Linux

    Go to [docker store](http://store.docker.com) it has instructions and dont install via package mamanger.
    This will get you the edge builds, which should be fine as docker moves fast.
    
    A cheat for installing is a script that you find  [here](http://get.docker.com). This gives a script that will install docker with ease.
    Inorder to stop using `sudo` with every command you have to add your user to the docker group:
    
        sudo usermod -aG docker <USERNAME>
    
    Then log out and log back in again.
    This is not recomended bu security so dont do that on prod. Some distros do not allow you to do this.
    
    Docker machine and docker compose have to ne installed manually on Linux boxes.
    [Docker machine](https://github.com/docker/machine/releases)
    [Docker compose installer](https://github.com/docker/compose/releases)
    
    Since these are manually installed you might have manually update them.

-   Shell customization

    [see bret&rsquo;s customization](http://bretfisher.com/shell)


<a id="org070bc65"></a>

## Creating and using containers


### checking config and isntallation

-   `docker version`

-   `docker info`


### Image vs container

-   An image is the application we want to run

-   A container is an instance of that image running as a process

    You can have many instances of an image running at the same time.


### Running a container

`docker container run --publish 80:80 ngix`

-   This downloads &rsquo;ngix&rsquo; image from docker hub.
-   Starts a container from that image.
-   Opened port 80 on the host IP
-   Routes that traffic to the container IP, port 80.

You can use the option `--detach` to run the above command in the background. The command will return a unique ID hack.
To see list the containers running use `docker container ls`. 
To stop a running container use `docker container stop <CONTAINER ID>`.
By default docker will give a random name that you use to address the container. You can set the name of the container by using `--name <NAME>` when you start the container.
`docker container logs <CONTAI"NER NAME>` will show you the logs produced by the container.
To clean up the stoped container you can issue the command `docker container rm <CONTAINER ID> <CONTAINER ID> ..`

What happens in `docker container run`
   1.Looks for that image locally in image cache, doesn&rsquo;t find anything
   2.Then looks in remote image repository (defaults to Docker Hub) 
   3.Downloads the latest version (nginx:latest by default) 
   4.Creates new container based on that image and prepares to start 
   5.Gives it a virtual IP on a private network inside docker engine 
   6.Opens up port 80 on host and forwards to port 80 in container 
   7.Starts container by using the CMD in the image Dockerfile

Docker is a procerss.


<a id="org19afb67"></a>

## Play

    docker container run --detach --publish 80:80  --name nginx  nginx
    docker container run --detach --publish 3306:3306  --name sql  --env MYSQL_RANDOM_ROOT_PASSWORD=yes mysql
    docker container logs sql | grep "PASSWORD"
    docker container run --detach --publish 8080:80  --name server httpd
    docker container ls -a
    docker container stop server sql nginx


<a id="orgfee85ce"></a>

## Basic look inside container

`docker container top`     - process list in one container   
`docker container inspect` - details of one container config    
`docker container stats`   - performance stats for all containers   


<a id="org4976971"></a>

## Running Shell commands in a container

`docker container run -it` - Starts the new container interactivly
 e.g:

    docker container run -it --name proxy nginx bash

The above example what we did was to override the default command that runs with a `bash` command.

`docker container exec -it` - Run command in container currently running
e.g:

    docker container exec -it mysql bash

The above example opens a terminal in the running container `mysql` 
`-it` is two seprate options:
`-t` also `-tty` this is a pseudo-tty -Simulates a real terminal like SSH.   
`-i`, `--interactive` Keeps the session open to receive terminal intput.


<a id="org1a54b42"></a>

## TODO Networks

`--publish` (`-p`) format in HOST:CONTAINER


### Networks CLI

-   TODO What is NAT in networking

-   `docker container inspect` This shows you the container configuration such as specific container like Networks, IP address, mounts, and current status. It can also be modified to only return a specific piece of data using the —format flag.


<a id="org550c8ff"></a>

## Container images finding and buidling them


### What is an images?

Just App binaries and dependencies with metadata about the image and how to run it.
There is no kernal or any drivers involved, those are provided by the host. (This is different to Virtual Machines)


<a id="orgbe71b60"></a>

## Building Docker Images

Dockerfiles are layered, each layer is cached so in the next build if the layer has not changed (its hash hasn&rsquo;t changed) it will not rebuild it from scratch.

    FROM //Typical start of docker file. Normally something small like Alpine linux
    ENV  //Sets enviroment vars
    ARGS //Set Variables
    RUN  // Command to run for set up such as apt-get
    WORKDIR // this is prefered way of changing directory over RUN cd
    EXPOSE //This opens up a port so that you can 'map' to it when running the image using -p option (e.g 80:3000)
    CMD     //The last command to run, such as /bash. This is inhereted from base image if not included.

For variables that are needed to build an image only its best to use `ARG` and inorder to set variables that are needed as *Enviroment Variables* in the ruuning container `ENV` is best suited.


### TODO prunning images


<a id="orgf964cbd"></a>

## Volumes and Bind mounts


### persistance data

Containers are immutable and ephermal, this means data will disapear as soon as its removed. So data such databases might lose data. To keep the data docker in two main ways:

-   Data Volumes

    Makes a special location outside of container UFS. Volumes live after the container and are only removed manually.
