docker-and-kubernetes.org
***** Creating Volume
      To Create a volume create an entry in the docker file:
      #+begin_src Dockerfile
        Volume /var/lib/mysql
      #+end_src
      This is setting the file path within the container file system which we want to persist on the host.
      To see current volume and thier set up
      #+begin_src bash
        docker image inspect 
      #+end_src
      Here you can see the image config including ~volumes~ and ~mounts~. In the mount section you can see where the volume is mounted, i.e how/where the host file is mapped to the container path. Under ~"Mounts"~ the field ~source~ gives the location of the host that the volume is writting to.
      The volumes currently mounted can be listed: 
     #+begin_src bash
        docker volume ls
      #+end_src
     The ~volume name~ from above command then can be passed into
     #+begin_src 
      docker volume inspect <volume name>
     #+end_src
     this will give all the details about the volume, including ~mount point~ and ~scope~.
     Inorder to use have more meaningful name for the volume we can use the ~-v~ option when we run the image.
     #+begin_src bash 
     docker container run -d --name mysql -e MYSQL_ALLOW_EMPTY_PASSWORD=True -v mysql-db:/var/lib/mysql mysql
     #+end_src
     This is called the named volume. The syntax is as follows ~volumename:volume location~.

**** TODO Bind Mounts
     Link container path to host path, i.e. maps hots file/directory to the container file/directory.
     When the file in the host changes the effect is seen in the running container. Bind mounts are used to speed up developments.
     Bind mounts can't be defined in the Dockerfile, they must be defined at ~container run~. 
     The syntax is similar to named volumes, the difference is the bind mounts start with ~/~ .
     #+begin_src bash
      docker container run -d --name ngix -p 80:80 -v $(pwd):/user/share/nginx/html nginx
     #+end_src
     The ~$(pwd)~ saves us from typing the full path of current directory.
** Docker Compose
  Docker compose is used to configure relationships between containers. It can also be used to save our container run settings in an easy to read file. It helps to create a one liner run command to bing up a whole stack. 
*** docker-compse.yaml
    In this file, the solution options for container, networks and volumes are defined.
    ~compose~ YAML format has its own versions, with each version more features have been added to docker.
    These files can be used locally by ~docker-compose~ or directly in production with Swarm by ~docker~ command.
The default name for these files is ~docker-compose.yaml~ however they can be anything by using ~docker-compose -f~
Full reference for [[https://docs.docker.com/compose/compose-file/][is here]]. However here is quick example of a ~docker-compose.yaml~ :

**** TODO -- comment on each line like in videos @ 3:46
 #+begin_src yaml
    version: '3.1'  # if no version is specified then v1 is assumed. Recommend v2 minimum

    services:  # containers. same as docker run
     servicename: # a friendly name. this is also DNS name inside network
       image: # Optional if you use build:
       command: # Optional, replace the default CMD specified by the image
       environment: # Optional, same as -e in docker run
       volumes: # Optional, same as -v in docker run
     servicename2:

    volumes: # Optional, same as docker volume create

    networks: # Optional, same as docker network create




 #+end_src

***** docker-compose CLI
seperate binary (bundled with mac and windows but linux have download/install sepreatly)
suited for local not prod.

docker-compose up
docker-compose down
* Swarm
Swarm has to be enabled. Whether swarm is enabled
#+BEGIN_SRC
docker info | grep -i "swarm"
#+END_SRC
** TODO RAFT
** TODO Manager Node
** TODO Worker Node
**

* Kubernetes
It is a popular orchestrator released by Google and maintained by comminuty. It runs on top of docker as a set of APIs in conatiners which provides API/CLI to manage conayiners across servers. Most cloud providers will have thier own distrobution of it available, like the EKS from aws.
** TODO Architecture
*** Control panel
3 masters which have
- etcd
- API
- Schedular
- Control manager
- CoreBNS

*** Nodes
They have
- Kubelet
- kube-proxy

** Minikube
*** TODO Install minikube
*** TODO Run minikube
~minikube start~
*** Test minikube
mini kube inserts configs into ~~/.kube/config~
At the end of the file see
#+BEGIN_SRC text

- name: minikube
  user:
    client-certificate: /Users/ebadiana/.minikube/profiles/minikube/client.crt
    client-key: /Users/ebadiana/.minikube/profiles/minikube/client.key
#+END_SRC


#+BEGIN_SRC bash

kubectl create deployment hello-node --image=k8s.gcr.io/echoserver:1.4
kubectl expose deployment hello-minikube --type=NodePort --port=8080
minikube service hello-node
#+END_SRC

The last command will open the browser to dispaly config:
#+BEGIN_SRC
CLIENT VALUES:
client_address=172.17.0.3
command=GET
real path=/
query=nil
request_version=1.1
request_uri=http://127.0.0.1:8080/

SERVER VALUES:
server_version=nginx: 1.10.0 - lua: 10001

HEADERS RECEIVED:
accept=text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
accept-encoding=gzip, deflate
accept-language=en-GB,en;q=0.5
connection=keep-alive
cookie=PGADMIN_KEY=f521540f-4134-4b44-b185-5073d3ad8ff6; PGADMIN_LANGUAGE=en
dnt=1
host=127.0.0.1:65481
upgrade-insecure-requests=1
user-agent=Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:79.0) Gecko/20100101 Firefox/79.0
BODY:
-no body in request-

#+END_SRC

*** TODO Stop minikube
~minikube stop~
*** TODO Delete
~minikube delete~

** Helm, packaaging and deploying
Helm is a package manager for kubernetes.
*** Charts
    Charts is a collection of files that describe a set Kubernetes resources.  A single chart can deploy an app, a piece of software or a database. it can also have dependencies.
    Charts use templates that will generate yaml files.

*** TODO What is tiller?
*** common Helm commands

|--------------------------------------------+---------------------------------|
| Command                                    | Description                     |
|--------------------------------------------+---------------------------------|
| ~helm init~                                | Install *tiller* on the cluster |
| ~helm reset~                               | Remove *tiller* from cluster    |
| ~helm install~                             | Install a helm chart            |
| ~helm search~                              | search for a chart              |
| ~helm list~                                | list releases                   |
| ~helm upgrade~                             | upgrade a release               |
| ~helm rollback~                            | rollback a release              |
| ~helm uninstall <pod name> -n <namespace>~ |                                 |
|--------------------------------------------+---------------------------------|
*** TODO Templates
These are Kubernetes mainifest files that describe the resources, which have to be deployed on the cluster.
*** TODO ~values.yaml~
This file provides default configureation data for the templates in a structured foramt.
