docker-and-kubernetes.md
    
    -   Creating Volume
    
        To Create a volume create an entry in the docker file:
        
            Volume /var/lib/mysql
        
        This is setting the file path within the container file system which we want to persist on the host.
        To see current volume and thier set up
        
            docker image inspect 
        
        Here you can see the image config including `volumes` and `mounts`. In the mount section you can see where the volume is mounted, i.e how/where the host file is mapped to the container path. Under `"Mounts"` the field `source` gives the location of the host that the volume is writting to.
        The volumes currently mounted can be listed: 
        
            docker volume ls
        
        The `volume name` from above command then can be passed into
        
            docker volume inspect <volume name>
        
        this will give all the details about the volume, including `mount point` and `scope`.
        Inorder to use have more meaningful name for the volume we can use the `-v` option when we run the image.
        
            docker container run -d --name mysql -e MYSQL_ALLOW_EMPTY_PASSWORD=True -v mysql-db:/var/lib/mysql mysql
        
        This is called the named volume. The syntax is as follows `volumename:volume location`.

-   TODO Bind Mounts

    Link container path to host path, i.e. maps hots file/directory to the container file/directory.
    When the file in the host changes the effect is seen in the running container. Bind mounts are used to speed up developments.
    Bind mounts can&rsquo;t be defined in the Dockerfile, they must be defined at `container run`. 
    The syntax is similar to named volumes, the difference is the bind mounts start with `/` .
    
        docker container run -d --name ngix -p 80:80 -v $(pwd):/user/share/nginx/html nginx
    
    The `$(pwd)` saves us from typing the full path of current directory.


<a id="org3a5160a"></a>

## Docker Compose

Docker compose is used to configure relationships between containers. It can also be used to save our container run settings in an easy to read file. It helps to create a one liner run command to bing up a whole stack. 


### docker-compse.yaml

    In this file, the solution options for container, networks and volumes are defined.
    `compose` YAML format has its own versions, with each version more features have been added to docker.
    These files can be used locally by `docker-compose` or directly in production with Swarm by `docker` command.
The default name for these files is `docker-compose.yaml` however they can be anything by using `docker-compose -f`
Full reference for [is here](https://docs.docker.com/compose/compose-file/). However here is quick example of a `docker-compose.yaml` :

-   TODO &#x2013; comment on each line like in videos @ 3:46

        version: '3.1'  # if no version is specified then v1 is assumed. Recommend v2 minimum
        
        services:  # containers. same as docker run
         servicename: # a friendly name. this is also DNS name inside network
           image: # Optional if you use build:
           command: # Optional, replace the default CMD specified by the image
           environment: # Optional, same as -e in docker run
           volumes: # Optional, same as -v in docker run
         servicename2:
        
        volumes: # Optional, same as docker volume create
        
        networks: # Optional, same as docker network create
    
    -   docker-compose CLI
    
        seperate binary (bundled with mac and windows but linux have download/install sepreatly)
        suited for local not prod.
        
        docker-compose up
        docker-compose down


<a id="orgaa88003"></a>

# Swarm

Swarm has to be enabled. Whether swarm is enabled

    docker info | grep -i "swarm"


<a id="org81998bf"></a>

## TODO RAFT


<a id="org6c9f46f"></a>

## TODO Manager Node


<a id="org9c591ad"></a>

## TODO Worker Node

\*\*


<a id="org57ea59a"></a>

# Kubernetes

It is a popular orchestrator released by Google and maintained by comminuty. It runs on top of docker as a set of APIs in conatiners which provides API/CLI to manage conayiners across servers. Most cloud providers will have thier own distrobution of it available, like the EKS from aws.


<a id="org85859fd"></a>

## TODO Architecture


### Control panel

3 masters which have

-   etcd
-   API
-   Schedular
-   Control manager
-   CoreBNS


### Nodes

They have

-   Kubelet
-   kube-proxy


<a id="org3188f3c"></a>

## Minikube


### TODO Install minikube


### TODO Run minikube

`minikube start`


### Test minikube

mini kube inserts configs into `~/.kube/config`
At the end of the file see

    
    - name: minikube
      user:
        client-certificate: /Users/ebadiana/.minikube/profiles/minikube/client.crt
        client-key: /Users/ebadiana/.minikube/profiles/minikube/client.key

    
    kubectl create deployment hello-node --image=k8s.gcr.io/echoserver:1.4
    kubectl expose deployment hello-minikube --type=NodePort --port=8080
    minikube service hello-node

The last command will open the browser to dispaly config:

    CLIENT VALUES:
    client_address=172.17.0.3
    command=GET
    real path=/
    query=nil
    request_version=1.1
    request_uri=http://127.0.0.1:8080/
    
    SERVER VALUES:
    server_version=nginx: 1.10.0 - lua: 10001
    
    HEADERS RECEIVED:
    accept=text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
    accept-encoding=gzip, deflate
    accept-language=en-GB,en;q=0.5
    connection=keep-alive
    cookie=PGADMIN_KEY=f521540f-4134-4b44-b185-5073d3ad8ff6; PGADMIN_LANGUAGE=en
    dnt=1
    host=127.0.0.1:65481
    upgrade-insecure-requests=1
    user-agent=Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:79.0) Gecko/20100101 Firefox/79.0
    BODY:
    -no body in request-


### TODO Stop minikube

`minikube stop`


### TODO Delete

`minikube delete`


<a id="org81ca67d"></a>

## Helm, packaaging and deploying

Helm is a package manager for kubernetes.


### Charts

Charts is a collection of files that describe a set Kubernetes resources.  A single chart can deploy an app, a piece of software or a database. it can also have dependencies.
Charts use templates that will generate yaml files.


### TODO What is tiller?


### common Helm commands

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left"><code>helm init</code></td>
<td class="org-left">Install <b>tiller</b> on the cluster</td>
</tr>


<tr>
<td class="org-left"><code>helm reset</code></td>
<td class="org-left">Remove <b>tiller</b> from cluster</td>
</tr>


<tr>
<td class="org-left"><code>helm install</code></td>
<td class="org-left">Install a helm chart</td>
</tr>


<tr>
<td class="org-left"><code>helm search</code></td>
<td class="org-left">search for a chart</td>
</tr>


<tr>
<td class="org-left"><code>helm list</code></td>
<td class="org-left">list releases</td>
</tr>


<tr>
<td class="org-left"><code>helm upgrade</code></td>
<td class="org-left">upgrade a release</td>
</tr>


<tr>
<td class="org-left"><code>helm rollback</code></td>
<td class="org-left">rollback a release</td>
</tr>


<tr>
<td class="org-left"><code>helm uninstall &lt;pod name&gt; -n &lt;namespace&gt;</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


### TODO Templates

These are Kubernetes mainifest files that describe the resources, which have to be deployed on the cluster.


### TODO `values.yaml`

This file provides default configureation data for the templates in a structured foramt.
