docker-and-kubernetes.org
* Cheat sheets
|----------+-----------------------------------------------------------+---------------------------------|
| Tool     | Command                                                   | Description                     |
|----------+-----------------------------------------------------------+---------------------------------|
| kubectl  | config get-contetexs                                      | Displays all contetexs/clusters |
|          | config use context <cluster-name>                         | switches the context/cluster    |
|          | logs -f -n <namespace> <podname>                          | view logs from pod              |
|          | exec --stdin --tty <pod-name> -n <namespace> -- /bin/bash | ssh into running pod            |
|----------+-----------------------------------------------------------+---------------------------------|
| minikube | start / stop /delete                                      |                                 |
|----------+-----------------------------------------------------------+---------------------------------|

*** commands ran for play

kubectl create deployment hello-node --image=k8s.gcr.io/echoserver:1.4
kubectl expose deployment hello-minikube --type=NodePort --port=8080
minikube service hello-node

*** TO READ

**** Vagrant
