docker-and-kubernetes.md


<a id="orgb625d62"></a>

# Cheat sheets

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tool</th>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">kubectl</td>
<td class="org-left">config get-contetexs</td>
<td class="org-left">Displays all contetexs/clusters</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">config use context &lt;cluster-name&gt;</td>
<td class="org-left">switches the context/cluster</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">logs -f -n &lt;namespace&gt; &lt;podname&gt;</td>
<td class="org-left">view logs from pod</td>
</tr>


<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">exec &#x2013;stdin &#x2013;tty &lt;pod-name&gt; -n &lt;namespace&gt; &#x2013; /bin/bash</td>
<td class="org-left">ssh into running pod</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-left">minikube</td>
<td class="org-left">start / stop /delete</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


### commands ran for play

kubectl create deployment hello-node &#x2013;image=k8s.gcr.io/echoserver:1.4
kubectl expose deployment hello-minikube &#x2013;type=NodePort &#x2013;port=8080
minikube service hello-node


### TO READ

-   Vagrant

